" Отключить режим совместимости с vi для полной функциональности Vim
set nocompatible

" Включить подсветку синтаксиса
syntax enable

" Установить цветовую схему (можно выбрать другую, например, desert, gruvbox и т.д.)
colorscheme desert

" Использовать системный буфер обмена для копирования и вставки
set clipboard=unnamedplus

" Включить поддержку мыши для выделения и прокрутки
"set mouse=a

" Отображать номера строк
"set number

" Включить автоматическое отступление
set autoindent

" Включить отображение текущей строки и столбца курсора
"set cursorline
"set cursorcolumn

" Включить подсветку поиска
set hlsearch

" Игнорировать регистр при поиске
set ignorecase

" Переходить в конец строки при переходе к новой строке в режиме вставки
set backspace=indent,eol,start
